       IDENTIFICATION DIVISION.
       PROGRAM-ID. SEQUENCE.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 FNAME	PIC X(10).
       PROCEDURE DIVISION.
           DISPLAY 'ENTER FIRST NAME: '
           ACCEPT FNAME.
           DISPLAY FNAME.
       STOP RUN.
